Tekla Open API Reference for Tekla Structures 2025
OBB Constructor (Point, Vector[], Double[])
 Initializes a new instance of the OBB class.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public OBB(
	Point center,
	Vector[] axis,
	double[] extent
)
Public Sub New (
	center As Point,
	axis As Vector(),
	extent As Double()
)
Parameters
center
Type: Tekla.Structures.Geometry3d.Point
Center point of the OBB.
axis
Type: Tekla.Structures.Geometry3d.Vector[]
Three element array of unit-length vectors parallel the axis of the OBB.
extent
Type: System.Double[]
Three element array of the OBB extents (half-lengths of the edges).
Exceptions
Exception | Condition
ArgumentException | Thrown when initialization fails.
See Also
Reference
OBB Class
OBB Overload
Tekla.Structures.Geometry3d Namespace